results/data/jvm-db/erik-laptop/quarkus-io-thread-5000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/fruits
  4 threads and 100 connections
  Thread calibration: mean lat.: 2.143ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.079ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.171ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.233ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms  302.58us  15.77ms   71.74%
    Req/Sec     1.26k    69.12     3.33k    55.02%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.33ms
 75.000%    1.48ms
 90.000%    1.59ms
 99.000%    1.75ms
 99.900%    3.09ms
 99.990%    4.89ms
 99.999%   15.30ms
100.000%   15.77ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.529     0.000000            1         1.00
       0.854     0.100000        23971         1.11
       1.011     0.200000        47906         1.25
       1.146     0.300000        71878         1.43
       1.244     0.400000        95837         1.67
       1.329     0.500000       120002         2.00
       1.365     0.550000       131953         2.22
       1.398     0.600000       143856         2.50
       1.429     0.650000       156059         2.86
       1.455     0.700000       167937         3.33
       1.480     0.750000       179799         4.00
       1.493     0.775000       185676         4.44
       1.509     0.800000       191833         5.00
       1.526     0.825000       197833         5.71
       1.544     0.850000       203622         6.67
       1.564     0.875000       209505         8.00
       1.576     0.887500       212716         8.89
       1.587     0.900000       215512        10.00
       1.600     0.912500       218570        11.43
       1.614     0.925000       221611        13.33
       1.628     0.937500       224442        16.00
       1.637     0.943750       226052        17.78
       1.646     0.950000       227524        20.00
       1.656     0.956250       229058        22.86
       1.667     0.962500       230564        26.67
       1.678     0.968750       231933        32.00
       1.685     0.971875       232691        35.56
       1.693     0.975000       233475        40.00
       1.701     0.978125       234226        45.71
       1.710     0.981250       234955        53.33
       1.720     0.984375       235690        64.00
       1.726     0.985938       236075        71.11
       1.733     0.987500       236442        80.00
       1.741     0.989062       236800        91.43
       1.750     0.990625       237180       106.67
       1.762     0.992188       237559       128.00
       1.769     0.992969       237725       142.22
       1.778     0.993750       237922       160.00
       1.792     0.994531       238098       182.86
       1.818     0.995313       238280       213.33
       1.875     0.996094       238470       256.00
       1.922     0.996484       238559       284.44
       2.149     0.996875       238652       320.00
       2.349     0.997266       238746       365.71
       2.501     0.997656       238839       426.67
       2.707     0.998047       238933       512.00
       2.815     0.998242       238980       568.89
       2.877     0.998437       239028       640.00
       2.957     0.998633       239073       731.43
       3.029     0.998828       239120       853.33
       3.105     0.999023       239167      1024.00
       3.159     0.999121       239191      1137.78
       3.239     0.999219       239213      1280.00
       4.091     0.999316       239238      1462.86
       4.451     0.999414       239261      1706.67
       4.519     0.999512       239290      2048.00
       4.555     0.999561       239295      2275.56
       4.567     0.999609       239310      2560.00
       4.623     0.999658       239320      2925.71
       4.643     0.999707       239330      3413.33
       4.683     0.999756       239348      4096.00
       4.683     0.999780       239348      4551.11
       4.707     0.999805       239354      5120.00
       4.715     0.999829       239365      5851.43
       4.715     0.999854       239365      6826.67
       4.891     0.999878       239378      8192.00
       4.891     0.999890       239378      9102.22
       4.891     0.999902       239378     10240.00
       4.895     0.999915       239381     11702.86
       6.339     0.999927       239383     13653.33
       6.891     0.999939       239386     16384.00
       6.947     0.999945       239387     18204.44
       9.759     0.999951       239389     20480.00
       9.871     0.999957       239390     23405.71
      10.591     0.999963       239392     27306.67
      10.615     0.999969       239393     32768.00
      10.647     0.999973       239394     36408.89
      14.863     0.999976       239395     40960.00
      14.863     0.999979       239395     46811.43
      15.071     0.999982       239396     54613.33
      15.199     0.999985       239397     65536.00
      15.199     0.999986       239397     72817.78
      15.295     0.999988       239398     81920.00
      15.295     0.999989       239398     93622.86
      15.295     0.999991       239398    109226.67
      15.463     0.999992       239399    131072.00
      15.463     0.999993       239399    145635.56
      15.463     0.999994       239399    163840.00
      15.463     0.999995       239399    187245.71
      15.463     0.999995       239399    218453.33
      15.775     0.999996       239400    262144.00
      15.775     1.000000       239400          inf
#[Mean    =        1.279, StdDeviation   =        0.303]
#[Max     =       15.768, Total count    =       239400]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  287773 requests in 1.00m, 46.67MB read
  Socket errors: connect 0, read 0, write 0, timeout 112
  Non-2xx or 3xx responses: 4
Requests/sec:   4796.09
Transfer/sec:    796.41KB