results/data/jvm-db/erik-laptop/quarkus-worker-pool-20000-WARM-UP.wrk2.out
Running 1m test @ http://erik-pc.local:8080/fruits
  4 threads and 100 connections
  Thread calibration: mean lat.: 20.438ms, rate sampling interval: 86ms
  Thread calibration: mean lat.: 20.261ms, rate sampling interval: 86ms
  Thread calibration: mean lat.: 20.987ms, rate sampling interval: 87ms
  Thread calibration: mean lat.: 21.274ms, rate sampling interval: 89ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.57ms   16.09ms  89.15ms   50.59%
    Req/Sec     5.03k   773.86     7.49k    65.40%
  1198764 requests in 1.00m, 194.35MB read
Requests/sec:  19979.56
Transfer/sec:      3.24MB